Repository: ProjectSuite/e2e-call-ios
Catalog: ecall/Resources/Localized/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, hi, it, ja, km_kh, ko, pt, ru, th, vi, zh_hans

# ErrSendOTPFailed
source: Failed to send OTP. Please try again.
ar: فشل إرسال OTP. يرجى المحاولة مرة أخرى.
de: OTP konnte nicht gesendet werden. Bitte versuchen Sie es erneut.
es: No se pudo enviar OTP. Por favor inténtalo de nuevo.
fr: Échec de l'envoi d'OTP. Veuillez réessayer.
hi: ओटीपी भेजने में विफल. कृपया पुन: प्रयास करें।
it: Impossibile inviare OTP. Per favore riprova.
ja: OTPの送信に失敗しました。もう一度試してください。
km_kh: បានបរាជ័យក្នុងការបញ្ជូន OTP ។ សូមព្យាយាមម្តងទៀត។
ko: OTP 전송에 실패했습니다. 다시 시도해 주세요.
pt: Falha ao enviar OTP. Por favor, tente novamente.
ru: Не удалось отправить OTP. Пожалуйста, попробуйте еще раз.
th: ไม่สามารถส่ง OTP โปรดลองอีกครั้ง
vi: Không gửi được OTP. Vui lòng thử lại.
zh_hans: 发送 OTP 失败。请再试一次。

# ErrStartCallFailed
source: Failed to start the call. Please try again.
ar: فشل بدء المكالمة. يرجى المحاولة مرة أخرى.
de: Der Anruf konnte nicht gestartet werden. Bitte versuchen Sie es erneut.
es: No se pudo iniciar la llamada. Por favor inténtalo de nuevo.
fr: Échec du démarrage de l'appel. Veuillez réessayer.
hi: कॉल प्रारंभ करने में विफल. कृपया पुन: प्रयास करें।
it: Impossibile avviare la chiamata. Per favore riprova.
ja: 通話の開始に失敗しました。もう一度試してください。
km_kh: បានបរាជ័យក្នុងការចាប់ផ្តើមការហៅ។ សូមព្យាយាមម្តងទៀត។
ko: 통화를 시작하지 못했습니다. 다시 시도해 주세요.
pt: Falha ao iniciar a chamada. Por favor, tente novamente.
ru: Не удалось начать вызов. Пожалуйста, попробуйте еще раз.
th: ไม่สามารถเริ่มการโทรได้ โปรดลองอีกครั้ง
vi: Không thể bắt đầu cuộc gọi. Vui lòng thử lại.
zh_hans: 无法开始通话。请再试一次。

# ErrTerminateOthersFailed
source: Failed to terminate other sessions. Please try again.
ar: فشل في إنهاء الجلسات الأخرى. يرجى المحاولة مرة أخرى.
de: Andere Sitzungen konnten nicht beendet werden. Bitte versuchen Sie es erneut.
es: No se pudieron finalizar otras sesiones. Por favor inténtalo de nuevo.
fr: Échec de la fin des autres sessions. Veuillez réessayer.
hi: अन्य सत्र समाप्त करने में विफल. कृपया पुन: प्रयास करें।
it: Impossibile terminare altre sessioni. Per favore riprova.
ja: 他のセッションの終了に失敗しました。もう一度試してください。
km_kh: បានបរាជ័យក្នុងការបញ្ចប់វគ្គផ្សេងទៀត។ សូមព្យាយាមម្តងទៀត។
ko: 다른 세션을 종료하지 못했습니다. 다시 시도해 주세요.
pt: Falha ao encerrar outras sessões. Por favor, tente novamente.
ru: Не удалось завершить другие сеансы. Пожалуйста, попробуйте еще раз.
th: ไม่สามารถยุติเซสชันอื่นได้ โปรดลองอีกครั้ง
vi: Không thể chấm dứt các phiên khác. Vui lòng thử lại.
zh_hans: 无法终止其他会话。请再试一次。

# ErrToggleFavoriteFailed
source: Failed to toggle favorite status. Please try again.
ar: فشل في تبديل الحالة المفضلة. يرجى المحاولة مرة أخرى.
de: Der Favoritenstatus konnte nicht umgeschaltet werden. Bitte versuchen Sie es erneut.
es: No se pudo alternar el estado de favorito. Por favor inténtalo de nuevo.
fr: Échec du changement du statut de favori. Veuillez réessayer.
hi: पसंदीदा स्थिति टॉगल करने में विफल. कृपया पुन: प्रयास करें।
it: Impossibile attivare/disattivare lo stato preferito. Per favore riprova.
ja: お気に入りステータスの切り替えに失敗しました。もう一度試してください。
km_kh: បានបរាជ័យក្នុងការបិទបើកស្ថានភាពដែលចូលចិត្ត។ សូមព្យាយាមម្តងទៀត។
ko: 즐겨찾기 상태를 전환하지 못했습니다. 다시 시도해 주세요.
pt: Falha ao alternar o status de favorito. Por favor, tente novamente.
ru: Не удалось переключить статус избранного. Пожалуйста, попробуйте еще раз.
th: ไม่สามารถสลับสถานะรายการโปรดได้ โปรดลองอีกครั้ง
vi: Không chuyển đổi được trạng thái yêu thích. Vui lòng thử lại.
zh_hans: 无法切换收藏夹状态。请再试一次。

# ErrTooManyFailedAttempts
source: Too many failed attempts. Please try again later.
ar: عدد كبير جدًا من المحاولات الفاشلة. يرجى المحاولة مرة أخرى في وقت لاحق.
de: Zu viele gescheiterte Versuche. Bitte versuchen Sie es später noch einmal.
es: Demasiados intentos fallidos. Inténtelo de nuevo más tarde.
fr: Trop de tentatives infructueuses. Veuillez réessayer plus tard.
hi: कई विफल प्रयास। कृपया बाद में पुन: प्रयास करें।
it: Troppi tentativi falliti. Per favore riprova più tardi.
ja: 失敗した試行が多すぎます。後でもう一度試してください。
km_kh: ការប៉ុនប៉ងបរាជ័យជាច្រើន។ សូមព្យាយាមម្តងទៀតនៅពេលក្រោយ។
ko: 실패한 시도가 너무 많습니다. 나중에 다시 시도해 주세요.
pt: Muitas tentativas fracassadas. Por favor, tente novamente mais tarde.
ru: Слишком много неудачных попыток. Пожалуйста, повторите попытку позже.
th: ความพยายามล้มเหลวมากเกินไป โปรดลองอีกครั้งในภายหลัง
vi: Quá nhiều lần thất bại. Vui lòng thử lại sau.
zh_hans: 失败的尝试太多了。请稍后重试。

# ErrUpdateCallFailed
source: Failed to update call. Please try again.
ar: فشل تحديث المكالمة. يرجى المحاولة مرة أخرى.
de: Anruf konnte nicht aktualisiert werden. Bitte versuchen Sie es erneut.
es: No se pudo actualizar la llamada. Por favor inténtalo de nuevo.
fr: Échec de la mise à jour de l'appel. Veuillez réessayer.
hi: कॉल अपडेट करने में विफल. कृपया पुन: प्रयास करें।
it: Impossibile aggiornare la chiamata. Per favore riprova.
ja: 通話を更新できませんでした。もう一度試してください。
km_kh: បានបរាជ័យក្នុងការធ្វើបច្ចុប្បន្នភាពការហៅ។ សូមព្យាយាមម្តងទៀត។
ko: 통화를 업데이트하지 못했습니다. 다시 시도해 주세요.
pt: Falha ao atualizar a chamada. Por favor, tente novamente.
ru: Не удалось обновить вызов. Пожалуйста, попробуйте еще раз.
th: ไม่สามารถอัปเดตการโทร โปรดลองอีกครั้ง
vi: Không cập nhật được cuộc gọi. Vui lòng thử lại.
zh_hans: 无法更新通话。请再试一次。

# ErrUpdateDeviceTokenFailed
source: Failed to update device token. Please try again.
ar: فشل في تحديث الرمز المميز للجهاز. يرجى المحاولة مرة أخرى.
de: Geräte-Token konnte nicht aktualisiert werden. Bitte versuchen Sie es erneut.
es: No se pudo actualizar el token del dispositivo. Por favor inténtalo de nuevo.
fr: Échec de la mise à jour du jeton de l'appareil. Veuillez réessayer.
hi: डिवाइस टोकन अपडेट करने में विफल. कृपया पुन: प्रयास करें।
it: Impossibile aggiornare il token del dispositivo. Per favore riprova.
ja: デバイストークンの更新に失敗しました。もう一度試してください。
km_kh: បានបរាជ័យក្នុងការធ្វើបច្ចុប្បន្នភាពឧបករណ៍និមិត្តសញ្ញា។ សូមព្យាយាមម្តងទៀត។
ko: 장치 토큰을 업데이트하지 못했습니다. 다시 시도해 주세요.
pt: Falha ao atualizar o token do dispositivo. Por favor, tente novamente.
ru: Не удалось обновить токен устройства. Пожалуйста, попробуйте еще раз.
th: อัปเดตโทเค็นอุปกรณ์ไม่สำเร็จ โปรดลองอีกครั้ง
vi: Không cập nhật được mã thông báo thiết bị. Vui lòng thử lại.
zh_hans: 无法更新设备令牌。请再试一次。

# ErrUpdateParticipantFailed
source: Failed to update participant. Please try again.
ar: فشل تحديث المشارك. يرجى المحاولة مرة أخرى.
de: Teilnehmer konnte nicht aktualisiert werden. Bitte versuchen Sie es erneut.
es: No se pudo actualizar el participante. Por favor inténtalo de nuevo.
fr: Échec de la mise à jour du participant. Veuillez réessayer.
hi: प्रतिभागी को अद्यतन करने में विफल. कृपया पुन: प्रयास करें।
it: Impossibile aggiornare il partecipante. Per favore riprova.
ja: 参加者を更新できませんでした。もう一度試してください。
km_kh: បានបរាជ័យក្នុងការធ្វើបច្ចុប្បន្នភាពអ្នកចូលរួម។ សូមព្យាយាមម្តងទៀត។
ko: 참가자를 업데이트하지 못했습니다. 다시 시도해 주세요.
pt: Falha ao atualizar o participante. Por favor, tente novamente.
ru: Не удалось обновить участника. Пожалуйста, попробуйте еще раз.
th: ไม่สามารถอัปเดตผู้เข้าร่วมได้ โปรดลองอีกครั้ง
vi: Không thể cập nhật người tham gia. Vui lòng thử lại.
zh_hans: 无法更新参与者。请再试一次。

# ErrUpdateUserFailed
source: Failed to update user. Please try again.
ar: فشل تحديث المستخدم. يرجى المحاولة مرة أخرى.
de: Benutzer konnte nicht aktualisiert werden. Bitte versuchen Sie es erneut.
es: No se pudo actualizar el usuario. Por favor inténtalo de nuevo.
fr: Échec de la mise à jour de l'utilisateur. Veuillez réessayer.
hi: उपयोगकर्ता को अपडेट करने में विफल. कृपया पुन: प्रयास करें।
it: Impossibile aggiornare l'utente. Per favore riprova.
ja: ユーザーの更新に失敗しました。もう一度試してください。
km_kh: បានបរាជ័យក្នុងការធ្វើបច្ចុប្បន្នភាពអ្នកប្រើប្រាស់។ សូមព្យាយាមម្តងទៀត។
ko: 사용자를 업데이트하지 못했습니다. 다시 시도해 주세요.
pt: Falha ao atualizar o usuário. Por favor, tente novamente.
ru: Не удалось обновить пользователя. Пожалуйста, попробуйте еще раз.
th: ไม่สามารถอัปเดตผู้ใช้ โปรดลองอีกครั้ง
vi: Không thể cập nhật người dùng. Vui lòng thử lại.
zh_hans: 更新用户失败。请再试一次。

# ErrUserAlreadyInCall
source: User is already in the call.
ar: المستخدم موجود بالفعل في المكالمة.
de: Der Benutzer ist bereits im Anruf.
es: El usuario ya está en la llamada.
fr: L'utilisateur est déjà en communication.
hi: उपयोगकर्ता पहले से ही कॉल में है.
it: L'utente è già coinvolto nella chiamata.
ja: ユーザーはすでに通話中です。
km_kh: អ្នកប្រើប្រាស់កំពុងហៅរួចហើយ។
ko: 사용자가 이미 통화 중입니다.
pt: O usuário já está na chamada.
ru: Пользователь уже участвует в разговоре.
th: ผู้ใช้อยู่ในสายแล้ว
vi: Người dùng đã tham gia cuộc gọi.
zh_hans: 用户已在通话中。

# ErrUserAlreadyRegistered
source: User is already registered.
ar: المستخدم مسجل بالفعل.
de: Der Benutzer ist bereits registriert.
es: El usuario ya está registrado.
fr: L'utilisateur est déjà enregistré.
hi: उपयोगकर्ता पहले से ही पंजीकृत है.
it: L'utente è già registrato.
ja: ユーザーはすでに登録されています。
km_kh: អ្នកប្រើត្រូវបានចុះឈ្មោះរួចហើយ។
ko: 사용자가 이미 등록되어 있습니다.
pt: O usuário já está cadastrado.
ru: Пользователь уже зарегистрирован.
th: ผู้ใช้ได้ลงทะเบียนแล้ว
vi: Người dùng đã được đăng ký.
zh_hans: 用户已注册。

# ErrUserNotAvailable
source: The user is currently not available.
ar: المستخدم غير متوفر حاليا.
de: Der Benutzer ist derzeit nicht verfügbar.
es: El usuario no está disponible actualmente.
fr: L'utilisateur n'est actuellement pas disponible.
hi: उपयोगकर्ता फिलहाल उपलब्ध नहीं है.
it: L'utente non è attualmente disponibile.
ja: ユーザーは現在利用できません。
km_kh: អ្នកប្រើប្រាស់បច្ចុប្បន្នមិនមានទេ។
ko: 해당 사용자는 현재 사용할 수 없습니다.
pt: O usuário não está disponível no momento.
ru: Пользователь в данный момент недоступен.
th: ผู้ใช้ไม่สามารถใช้งานได้ในขณะนี้
vi: Người dùng hiện không có sẵn.
zh_hans: 该用户当前不可用。

# ErrUserNotFound
source: User not found.
ar: لم يتم العثور على المستخدم.
de: Benutzer nicht gefunden.
es: Usuario no encontrado.
fr: Utilisateur introuvable.
hi: उपयोगकर्ता नहीं मिला.
it: Utente non trovato.
ja: ユーザーが見つかりません。
km_kh: រកមិនឃើញអ្នកប្រើ។
ko: 사용자를 찾을 수 없습니다.
pt: Usuário não encontrado.
ru: Пользователь не найден.
th: ไม่พบผู้ใช้
vi: Không tìm thấy người dùng.
zh_hans: 未找到用户。

# ErrVerifyOTPFailed
source: Failed to verify OTP. Please try again.
ar: فشل التحقق من OTP. يرجى المحاولة مرة أخرى.
de: OTP-Verifizierung fehlgeschlagen. Bitte erneut versuchen.
es: No se pudo verificar el OTP. Inténtalo de nuevo.
fr: Échec de la vérification OTP. Veuillez réessayer.
hi: OTP सत्यापन विफल हुआ। कृपया पुनः प्रयास करें।
it: Verifica OTP non riuscita. Riprova.
ja: OTPの確認に失敗しました。再度お試しください。
km_kh: បរាជ័យក្នុងការផ្ទៀងផ្ទាត់ OTP។ សូមព្យាយាមម្តងទៀត។
ko: OTP 인증에 실패했습니다. 다시 시도하세요.
pt: Falha ao verificar o OTP. Tente novamente.
ru: Не удалось подтвердить OTP. Повторите попытку.
th: ยืนยัน OTP ไม่สำเร็จ โปรดลองอีกครั้ง
vi: Xác thực OTP thất bại. Vui lòng thử lại.
zh_hans: OTP 验证失败。请重试。

# failed_generate_keys
source: Failed to generate RSA keys.
ar: فشل في إنشاء مفاتيح RSA.
de: RSA-Schlüssel konnten nicht erzeugt werden.
es: No se pudo generar las claves RSA.
fr: Échec de génération des clés RSA.
hi: RSA कुंजी जनरेट करने में विफल।
it: Generazione chiavi RSA non riuscita.
ja: RSA鍵の生成に失敗しました。
km_kh: បរាជ័យក្នុងការបង្កើតកូនសោ RSA
ko: RSA 키 생성에 실패했습니다.
pt: Falha ao gerar chaves RSA.
ru: Не удалось сгенерировать ключи RSA.
th: สร้างกุญแจ RSA ไม่สำเร็จ
vi: Tạo khóa RSA thất bại.
zh_hans: 生成 RSA 密钥失败。

source: Favorite
ar: المفضلة
de: Favorit
es: Favorito
fr: Favori
hi: पसंदीदा
it: Preferito
ja: お気に入り
km_kh: ជាសំណើច
ko: 즐겨찾기
pt: Favorito
ru: Избранное
th: รายการโปรด
vi: Yêu thích
zh_hans: 收藏

source: Favorites
ar: المفضلة
de: Favoriten
es: Favoritos
fr: Favoris
hi: पसंदीदा
it: Preferiti
ja: お気に入り
km_kh: ជាសំណើច
ko: 즐겨찾기
pt: Favoritos
ru: Избранное
th: รายการโปรด
vi: Yêu thích
zh_hans: 收藏

# friend_request_accepted_content
source: %@ accepted your friend request. You can start calling each other now
ar: %@ قبل طلب الصداقة الخاص بك. يمكنكم الآن البدء في الاتصال ببعضكم البعض
de: %@ hat Ihre Freundschaftsanfrage angenommen. Sie können jetzt miteinander telefonieren
es: %@ aceptó tu solicitud de amistad. Ahora pueden comenzar a llamarse
fr: %@ a accepté votre demande d'amitié. Vous pouvez maintenant commencer à vous appeler
hi: %@ ने आपका दोस्ती का अनुरोध स्वीकार कर लिया है। अब आप एक-दूसरे को कॉल कर सकते हैं
it: %@ ha accettato la tua richiesta di amicizia. Ora potete iniziare a chiamarvi
ja: %@があなたの友達リクエストを承認しました。今すぐ通話を始めることができます
km_kh: %@ បានយល់ស្របសំណើជាមិត្តរបស់អ្នក។ អ្នកអាចចាប់ផ្តើមហៅគ្នាឥឡូវនេះ
ko: %@님이 친구 요청을 수락했습니다. 이제 서로 통화할 수 있습니다
pt: %@ aceitou a sua solicitação de amizade. Agora podem começar a telefonar um ao outro
ru: %@ принял ваш запрос в друзья. Теперь вы можете начать звонить друг другу
th: %@ ยอมรับคำขอเป็นเพื่อนของคุณ ตอนนี้คุณสามารถเริ่มโทรหากันได้แล้ว
vi: %@ đã đồng ý lời mời kết bạn. Hai bạn có thể bắt đầu trò chuyện ngay
zh_hans: %@ 接受了您的好友请求。现在你们可以开始通话了

# friend_request_accepted_title
source: You and %@ are now friends 🎉
ar: أنت و %@ أصدقاء الآن 🎉
de: Sie und %@ sind jetzt Freunde 🎉
es: Tú y %@ ahora son amigos 🎉
fr: Vous et %@ êtes maintenant amis 🎉
hi: आप और %@ अब दोस्त हैं 🎉
it: Tu e %@ ora siete amici 🎉
ja: あなたと%@は今友達です 🎉
km_kh: អ្នកនិង %@ ឥឡូវជាមិត្តគ្នា 🎉
ko: 당신과 %@님이 이제 친구입니다 🎉
pt: Você e %@ são agora amigos 🎉
ru: Вы и %@ теперь друзья 🎉
th: คุณและ %@ เป็นเพื่อนกันแล้ว 🎉
vi: Bạn và %@ đã trở thành bạn bè 🎉
zh_hans: 您和 %@ 现在是好友了 🎉

# friend_request_sent_success
source: Friend request sent successfully
ar: تم إرسال طلب الصداقة بنجاح
de: Freundschaftsanfrage erfolgreich gesendet
es: Solicitud de amistad enviada exitosamente
fr: Demande d'amitié envoyée avec succès
hi: दोस्ती का अनुरोध सफलतापूर्वक भेजा गया
it: Richiesta di amicizia inviata con successo
ja: 友達リクエストが正常に送信されました
km_kh: សំណើជាមិត្តត្រូវបានផ្ញើដោយជោគជ័យ
ko: 친구 요청이 성공적으로 전송되었습니다
pt: Solicitação de amizade enviada com sucesso
ru: Запрос в друзья успешно отправлен
th: ส่งคำขอเป็นเพื่อนสำเร็จแล้ว
vi: Đã gửi lời mời kết bạn thành công
zh_hans: 好友请求发送成功

source: Friend Requests
ar: طلبات الصداقة
de: Freundschaftsanfragen
es: Solicitudes de amistad
fr: Demandes d'amis
hi: मित्रता अनुरोध
it: Richieste di amicizia
ja: 友達リクエスト
km_kh: សំណើរមិត្តភាព
ko: 친구 요청
pt: Solicitações de amizade
ru: Запросы в друзья
th: คำขอเป็นเพื่อน
vi: Lời mời kết bạn
zh_hans: 好友请求

source: Friends
ar: أصدقاء
de: Freunde
es: Amigos
fr: Amis
hi: मित्र
it: Amici
ja: 友達
km_kh: មិត្តភក្តិ
ko: 친구
pt: Amigos
ru: Друзья
th: เพื่อน
vi: Bạn bè
zh_hans: 朋友

source: Generate
ar: توليد
de: Erzeugen
es: Generar
fr: Générer
hi: जेनरेट करें
it: Genera
ja: 生成
km_kh: បង្កើត
ko: 생성
pt: Gerar
ru: Генерировать
th: สร้าง
vi: Tạo
zh_hans: 生成

source: Generate new
ar: توليد جديد
de: Neu generieren
es: Generar nuevo
fr: Générer nouveau
hi: नया जेनरेट करें
it: Genera nuovo
ja: 新しく生成
km_kh: បង្កើតថ្មី
ko: 새로 생성
pt: Gerar novo
ru: Сгенерировать новый
th: สร้างใหม่
vi: Tạo mới
zh_hans: 生成新的

source: Generate New Keys
ar: توليد مفاتيح جديدة
de: Neue Schlüssel erzeugen
es: Generar nuevas claves
fr: Générer de nouvelles clés
hi: नई कुंजी जेनरेट करें
it: Genera nuove chiavi
ja: 新しい鍵を生成
km_kh: បង្កើតកូនសោថ្មី
ko: 새 키 생성
pt: Gerar novas chaves
ru: Сгенерировать новые ключи
th: สร้างกุญแจใหม่
vi: Tạo khóa mới
zh_hans: 生成新密钥

source: Group Call
ar: مكالمة جماعية
de: Gruppenanruf
es: Llamada grupal
fr: Appel de groupe
hi: समूह कॉल
it: Chiamata di gruppo
ja: グループ通話
km_kh: ការហៅក្រុម
ko: 그룹 통화
pt: Chamada em grupo
ru: Групповой звонок
th: การโทรแบบกลุ่ม
vi: Gọi nhóm
zh_hans: 群组通话

source: Hide Key
ar: إخفاء المفتاح
de: Schlüssel ausblenden
es: Ocultar clave
fr: Masquer la clé
hi: कुंजी छिपाएं
it: Nascondi chiave
ja: キーを隠す
km_kh: លាក់កូនសោ
ko: 키 숨기기
pt: Ocultar chave
ru: Скрыть ключ
th: ซ่อนคีย์
vi: Ẩn khóa
zh_hans: 隐藏密钥

source: hours
ar: ساعات
de: Stunden
es: horas
fr: heures
hi: घंटे
it: ore
ja: 時間
km_kh: ម៉ោង
ko: 시간
pt: horas
ru: часов
th: ชั่วโมง
vi: giờ
zh_hans: 小时

source: Import
ar: استيراد
de: Importieren
es: Importar
fr: Importer
hi: आयात करें
it: Importa
ja: インポート
km_kh: នាំចូល
ko: 가져오기
pt: Importar
ru: Импорт
th: นำเข้า
vi: Nhập khẩu
zh_hans: 导入

source: Import Existing Keys
ar: استيراد المفاتيح الحالية
de: Vorhandene Schlüssel importieren
es: Importar claves existentes
fr: Importer les clés existantes
hi: मौजूदा कुंजी आयात करें
it: Importa chiavi esistenti
ja: 既存の鍵をインポート
km_kh: នាំចូលកូនសោមានស្រាប់
ko: 기존 키 가져오기
pt: Importar chaves existentes
ru: Импортировать существующие ключи
th: นำเข้ากุญแจที่มีอยู่
vi: Nhập khóa hiện có
zh_hans: 导入现有密钥

source: Incoming
ar: وارد
de: Eingehend
es: Entrante
fr: Entrant
hi: इनकमिंग
it: In arrivo
ja: 着信
km_kh: ចូល
ko: 수신
pt: Recebida
ru: Входящий
th: สายเข้า
vi: Gọi đến
zh_hans: 来电

source: Invalid data
ar: بيانات غير صالحة
de: Ungültige Daten
es: Datos inválidos
fr: Données invalides
hi: अमान्य डेटा
it: Dati non validi
ja: 無効なデータ
km_kh: ទិន្នន័យមិនត្រឹមត្រូវ
ko: 잘못된 데이터
pt: Dados inválidos
ru: Неверные данные
th: ข้อมูลไม่ถูกต้อง
vi: Dữ liệu không hợp lệ
zh_hans: 无效数据

source: Invalid email format.
ar: تنسيق البريد الإلكتروني غير صالح.
de: Ungültiges E-Mail-Format.
es: Formato de email inválido.
fr: Format d'email invalide.
hi: अमान्य ईमेल प्रारूप।
it: Formato email non valido.
ja: 無効なメール形式です。
km_kh: ទម្រង់អ៊ីមែលមិនត្រឹមត្រូវទេ។
ko: 잘못된 이메일 형식입니다.
pt: Formato de email inválido.
ru: Неверный формат электронной почты.
th: รูปแบบอีเมลไม่ถูกต้อง
vi: Định dạng email không hợp lệ.
zh_hans: 邮箱格式无效。

source: Invalid key format.
ar: تنسيق المفتاح غير صالح.
de: Ungültiges Schlüssel-Format.
es: Formato de clave inválido.
fr: Format de clé invalide.
hi: अमान्य कुंजी प्रारूप।
it: Formato chiave non valido.
ja: 鍵の形式が無効です。
km_kh: ទ្រង់ទ្រាយកូនសោមិនត្រឹមត្រូវ
ko: 잘못된 키 형식입니다.
pt: Formato de chave inválido.
ru: Неверный формат ключа.
th: รูปแบบกุญแจไม่ถูกต้อง
vi: Định dạng khóa không hợp lệ.
zh_hans: 密钥格式无效。

# invalid_phone_format
source: Invalid phone number format.
ar: تنسيق رقم الهاتف غير صالح.
de: Ungültiges Telefonnummernformat.
es: Formato de número de teléfono inválido.
fr: Format de numéro de téléphone invalide.
hi: अमान्य फोन नंबर प्रारूप।
it: Formato numero di telefono non valido.
ja: 無効な電話番号形式です。
km_kh: ទម្រង់លេខទូរស័ព្ទមិនត្រឹមត្រូវទេ។
ko: 잘못된 전화번호 형식입니다.
pt: Formato de número de telefone inválido.
ru: Неверный формат номера телефона.
th: รูปแบบหมายเลขโทรศัพท์ไม่ถูกต้อง
vi: Định dạng số điện thoại không hợp lệ.
zh_hans: 电话号码格式无效。

# invalid_qr_code
source: This QR cannot be used to add friends. Please try a valid one
ar: لا يمكن استخدام هذا الرمز لإضافة الأصدقاء. يرجى تجربة رمز صالح
de: Dieser QR-Code kann nicht zum Hinzufügen von Freunden verwendet werden. Bitte versuchen Sie einen gültigen
es: Este QR no se puede usar para agregar amigos. Por favor, prueba uno válido
fr: Ce QR ne peut pas être utilisé pour ajouter des amis. Veuillez essayer un QR valide
hi: यह QR दोस्त जोड़ने के लिए नहीं किया जा सकता। कृपया एक वैध QR कोशिश करें
it: Questo QR non può essere utilizzato per aggiungere amici. Prova uno valido
ja: このQRは友達を追加するために使用できません。有効なQRをお試しください
km_kh: QR នេះមិនអាចប្រើដើម្បីបន្ថែមមិត្តបានទេ។ សូមព្យាយាម QR ត្រឹមត្រូវ
ko: 이 QR은 친구를 추가하는 데 사용할 수 없습니다. 유효한 QR을 시도해 주세요
pt: Este QR não pode ser usado para adicionar amigos. Por favor, tente um QR válido
ru: Этот QR-код нельзя использовать для добавления друзей. Пожалуйста, попробуйте действительный QR-код
th: QR นี้ไม่สามารถใช้เพื่อเพิ่มเพื่อนได้ กรุณาลองใช้ QR ที่ถูกต้อง
vi: Bạn không thể dùng QR này để thêm bạn. Vui lòng quét QR hợp lệ
zh_hans: 此QR码不能用于添加好友。请尝试有效的QR码

# invalid_rejoin_room_information
source: Unable to rejoin the call. Please try again or start a new call.
ar: لا يمكن إعادة الانضمام إلى المكالمة. يرجى المحاولة مرة أخرى أو بدء مكالمة جديدة.
de: Der Anruf kann nicht erneut beigetreten werden. Bitte versuchen Sie es erneut oder starten Sie einen neuen Anruf.
es: No se puede volver a unir a la llamada. Por favor, inténtelo de nuevo o inicie una nueva llamada.
fr: Impossible de rejoindre l'appel. Veuillez réessayer ou démarrer un nouvel appel.
hi: कॉल में फिर से शामिल नहीं हो सकते। कृपया पुनः प्रयास करें या नई कॉल शुरू करें।
it: Impossibile riunirsi alla chiamata. Riprova o avvia una nuova chiamata.
ja: 通話に再接続できません。もう一度お試しいただくか、新しい通話を開始してください。
km_kh: មិនអាចចូលការហៅទាំងមូលម្តងទៀតបានទេ។ សូមព្យាយាមម្តងទៀត ឬចាប់ផ្តើមការហៅថ្មី។
ko: 통화에 다시 참여할 수 없습니다. 다시 시도하거나 새 통화를 시작하세요.
pt: Não é possível voltar a entrar na chamada. Tente novamente ou inicie uma nova chamada.
ru: Невозможно вернуться к звонку. Попробуйте снова или начните новый звонок.
th: ไม่สามารถเข้าร่วมการโทรอีกครั้งได้ โปรดลองอีกครั้งหรือเริ่มการโทรใหม่
vi: Không thể tham gia lại cuộc gọi. Vui lòng thử lại hoặc bắt đầu cuộc gọi mới.
zh_hans: 无法重新加入通话。请重试或开始新的通话。

# invalid_url
source: The URL provided was invalid.
ar: عنوان URL المقدم غير صالح.
de: Ungültige URL.
es: La URL proporcionada no es válida.
fr: URL fournie invalide.
hi: दिया गया URL अमान्य है।
it: URL fornito non valido.
ja: 無効なURLです。
km_kh: URL មិនត្រឹមត្រូវ
ko: 잘못된 URL입니다.
pt: URL fornecida inválida.
ru: Неверный URL.
th: URL ไม่ถูกต้อง
vi: URL không hợp lệ.
zh_hans: 提供的 URL 无效。

source: Inviting
ar: دعوة
de: Einladung
es: Invitando
fr: Invitation
hi: आमंत्रित
it: Invito
ja: 招待中
km_kh: កំពុងអញ្ជើញ
ko: 초대 중
pt: Convidando
ru: Приглашение
th: กำลังเชิญ
vi: Đang mời
zh_hans: 邀请中

source: Join
ar: انضم
de: Beitreten
es: Unirse
fr: Rejoindre
hi: शामिल हों
it: Partecipa
ja: 参加
km_kh: ចូលរួម
ko: 참여
pt: Participar
ru: Присоединиться
th: เข้าร่วม
vi: Tham gia
zh_hans: 加入

source: Joined
ar: انضم
de: Beigetreten
es: Se unió
fr: Rejoint
hi: शामिल हुए
it: Si è unito
ja: 参加済み
km_kh: បានចូលរួម
ko: 참여함
pt: Juntou-se
ru: Присоединился
th: เข้าร่วมแล้ว
vi: Đã tham gia
zh_hans: 已加入

# keep_key_secret
source: Keep this key secret. Replacing it will invalidate current E2EE sessions.
ar: احتفظ بهذا المفتاح سراً. استبداله سيجعل جلسات E2EE الحالية غير صالحة.
de: Bewahren Sie diesen Schlüssel geheim auf. Das Ersetzen wird aktuelle E2EE-Sitzungen ungültig machen.
es: Mantenga esta clave en secreto. Reemplazarla invalidará las sesiones E2EE actuales.
fr: Gardez cette clé secrète. La remplacer invalidera les sessions E2EE actuelles.
hi: इस कुंजी को गुप्त रखें। इसे बदलने से वर्तमान E2EE सत्र अमान्य हो जाएंगे।
it: Mantieni questa chiave segreta. Sostituirla invaliderà le sessioni E2EE attuali.
ja: このキーを秘密にしてください。置き換えると現在のE2EEセッションが無効になります。
km_kh: រក្សាកូនសោនេះជាអាថិភាគ។ ការជំនួសវានឹងធ្វើឱ្យវគ្គ E2EE បច្ចុប្បន្នមិនត្រឹមត្រូវ។
ko: 이 키를 비밀로 유지하세요. 교체하면 현재 E2EE 세션이 무효화됩니다.
pt: Mantenha esta chave em segredo. Substituí-la invalidará as sessões E2EE atuais.
ru: Храните этот ключ в секрете. Замена сделает недействительными текущие сессии E2EE.
th: เก็บคีย์นี้เป็นความลับ การแทนที่จะทำให้เซสชัน E2EE ปัจจุบันไม่ถูกต้อง
vi: Giữ khóa này bí mật. Thay thế sẽ làm mất hiệu lực các phiên E2EE hiện tại.
zh_hans: 请保持此密钥的秘密性。替换它将使当前的E2EE会话失效。

source: Key
ar: المفتاح
de: Schlüssel
es: Clave
fr: Clé
hi: कुंजी
it: Chiave
ja: キー
km_kh: កូនសោ
ko: 키
pt: Chave
ru: Ключ
th: คีย์
vi: Khóa
zh_hans: 密钥

source: Key must be Base64.
ar: يجب أن يكون المفتاح Base64.
de: Schlüssel muss Base64 sein.
es: La clave debe ser Base64.
fr: La clé doit être Base64.
hi: कुंजी Base64 होनी चाहिए।
it: La chiave deve essere Base64.
ja: キーはBase64である必要があります。
km_kh: កូនសោត្រូវតែជា Base64។
ko: 키는 Base64여야 합니다.
pt: A chave deve ser Base64.
ru: Ключ должен быть в формате Base64.
th: คีย์ต้องเป็น Base64
vi: Khóa phải là Base64.
zh_hans: 密钥必须是Base64格式。

# key_must_decode_to_32_bytes
source: Key must decode to 32 bytes (AES-256).
ar: يجب أن يتحلل المفتاح إلى 32 بايت (AES-256).
de: Schlüssel muss zu 32 Bytes (AES-256) dekodieren.
es: La clave debe decodificar a 32 bytes (AES-256).
fr: La clé doit décoder en 32 octets (AES-256).
hi: कुंजी 32 बाइट (AES-256) में डिकोड होनी चाहिए।
it: La chiave deve decodificare a 32 byte (AES-256).
ja: キーは32バイト（AES-256）にデコードする必要があります。
km_kh: កូនសោត្រូវតែដកស្រង់ទៅជា 32 bytes (AES-256)។
ko: 키는 32바이트(AES-256)로 디코딩해야 합니다.
pt: A chave deve decodificar para 32 bytes (AES-256).
ru: Ключ должен декодироваться в 32 байта (AES-256).
th: คีย์ต้องถอดรหัสเป็น 32 ไบต์ (AES-256)
vi: Khóa phải giải mã thành 32 byte (AES-256).
zh_hans: 密钥必须解码为32字节（AES-256）。
